Revit 2027 API
SelectionFilterAction Enumeration
 An enumerated type containing the type of actions that may be taken with a selection filter applied to a point cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SelectionFilterAction
Public Enumeration SelectionFilterAction
public enum class SelectionFilterAction
type SelectionFilterAction
Members
Member name | Value | Description
Highlight | 1 |  Points that pass the filter are highlighted.
Isolate | 2 |  Only points that pass the filter are visible.
None | 0 |  Selection filter is ignored.
See Also
Reference
Autodesk.Revit.DB Namespace